In [2]:
import pandas as pd
import numpy as np

In [3]:
# Create a customer dataframe object
df = pd.DataFrame({'Customer': 'Norman Greg Erin Chester Uohna Jeffery'.split(),
                   'Costs_1': np.arange(6) * 2,
                   'Costs_2': np.arange(6) * 3,
                   'Costs_3': np.arange(6) * 4})

df

  Customer  Costs_1  Costs_2  Costs_3
0   Norman        0        0        0
1     Greg        2        3        4
2     Erin        4        6        8
3  Chester        6        9       12
4    Uohna        8       12       16
5  Jeffery       10       15       20

In [5]:

df['Customer'].map(lambda x: str(x) + "_SF")

0     Norman_SF
1       Greg_SF
2       Erin_SF
3    Chester_SF
4      Uohna_SF
5    Jeffery_SF
Name: Customer, dtype: object

In [6]:

df.applymap(lambda x: str(x) + "_SF")

     Customer Costs_1 Costs_2 Costs_3
0   Norman_SF    0_SF    0_SF    0_SF
1     Greg_SF    2_SF    3_SF    4_SF
2     Erin_SF    4_SF    6_SF    8_SF
3  Chester_SF    6_SF    9_SF   12_SF
4    Uohna_SF    8_SF   12_SF   16_SF
5  Jeffery_SF   10_SF   15_SF   20_SF

In [9]:
df[['Customer', 'Costs_1']].applymap(lambda x: str(x) + "_SF")

     Customer Costs_1
0   Norman_SF    0_SF
1     Greg_SF    2_SF
2     Erin_SF    4_SF
3  Chester_SF    6_SF
4    Uohna_SF    8_SF
5  Jeffery_SF   10_SF

In [10]:
df[['Customer']].applymap(lambda x: str(x) + "_SF")

     Customer
0   Norman_SF
1     Greg_SF
2     Erin_SF
3  Chester_SF
4    Uohna_SF
5  Jeffery_SF

In [12]:
df[(df["Customer"] == 'Norman')]

  Customer  Costs_1  Costs_2  Costs_3
0   Norman        0        0        0